"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например: 
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user_dict() которая с помощью input() просит 
  пользователя ввести вопрос, а затем, если вопрос есть в словаре, 
  программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
    
"""
dialogue = {"Как дела?": "Хорошо!", "Что делаешь?": "Программирую",
"Какие планы?": "Наполеоновские"}

def ask_user():
    while True:
      ask_user = input('Введите ваш вопрос: ')
      for key, value in dialogue.items():
        if ask_user == key:
          print(value)
          break 
      else:
        print("Напишите другой вопрос")

if __name__ == "__main__":
    ask_user()
